const ARTICLES = ["10月の真実", "2x2=4", "42", "ABB型ワード", "AEIOU英単語", "Cookie Clicker", "Cooking小沢", "FAQ", "Facepalm", "Ggrks", "IQ調査", "IQ調査結果", "Jafjaf", "LINEのユーザー名変更", "SCP", "Scratch", "Test", "WikiWiki", "WikiWiki同好会ボカロ祭り", "Wikipedia", "Wikiwiki", "ĐĔĐĔÑíŎÑÑ", "◯◯◯◯◯◯◯◯◯◯◯◯◯◯◯", "「呪術廻戦」ファンの夢を叶えるページ", "「呪術廻戦」ファンの細やかなニーズに応えるページ", "あぶり出し", "あまおう", "うっせぇわ的話法", "うに政治", "うろ覚え", "うんたらかんたらちょめちょめ", "お母さん", "お転婆", "しりとり", "しりとりのコンテスチートせし", "じがくちょう", "じゃんけん", "じんとうよう", "す○ぷりすなー", "ですます百科自伝", "どんないろがすき理論", "はい", "はす", "ひつまぶし", "ほうれん草", "ほえふぇあ語", "わり箸", "アナハイムアマゾンリンボーランボー", "アボガド", "アンサー", "アンモク共和国", "アーノロン症候群", "イクスティンクション", "イクスティンクションオンライン", "イチモウダ人", "イルミナティ", "ウィキヴィッキー=ソビエト社会主義共和国", "エトセトラ", "エリババレイジ", "エンドルフィン", "オニャンコポン", "オバァの唇化現象", "オーストロェイリア", "カオスオス", "キャベツ", "キュアラプラプ", "キュートショルダレーション", "ギニア", "クラーグム", "クリプトムネジア現象", "クローズドサークル", "クーネル・サンダース", "ケツアゴコロロ/サンドボックス甲", "ゲシュタルト崩壊", "ゲリ", "ゲロ", "コナンかよ現象", "コマツナ", "コラッ予想", "コンピューター", "ゴギョウ", "ゴミ", "サイコパス診断", "サリンドの共鳴", "サンドボックス", "ザーサイ", "シフォンの犬", "シュクストムス", "シンジツノクチ", "ジ、エンドウマメ", "ジョン", "スクヂィク", "スジンハスガーク", "スズシロ", "スズナ", "スベリヒユ", "スペシウム", "スマート本", "スラム", "セリ", "ソウジアラビア", "ソーイエバ (宗教)", "ソーイエバ (感動詞)", "タイトル詐欺", "タコさんウィンナー", "ターゲット俳句", "チェーンソー和歌", "テレビ", "デデンネ教", "デデンネ聖典", "デデ二オン", "トマト文", "トートロジー", "ドア派", "ドッペルゲンガー", "ナズナ", "ナマステハムナム", "ニラ零細素片人工降雨禁止令事件", "ハクンアクラー", "ハコベラ", "ハッピーランドヘルスセカンド", "ハン・ドレッド", "ハン＝ドレッド", "バイトテロ", "バッハ人格", "ヒカチュウ教", "ヒジュラ", "ヒユ", "ビームフラッシュじゃんけん部一属性縛り", "ピカチュウ", "ピカチュウ教", "ピカチュウ神話", "ピカバイブル", "ピロリ語", "ププニュレキアラーラ", "ホトケノザ", "ポインコ", "ポケモン・ザ・ムービー XY 光輪の超魔神フーパ", "マイケル・ジョーダン", "ミルン現象", "ムラ", "メインページ", "メロンパン", "ヨーグルト", "ヨーグルト (曖昧さ回避)", "ヨー語", "ラプラプの悪魔", "リパーツクブキュルー", "リンク1", "リンク11", "リンク2", "リンク3", "リンク4", "リンク5", "リンク6", "リンク7", "リンク8", "リンク神", "リンク５", "ルービックキューブ", "レタス", "レモン汁", "ロシア的倒置法", "ンジャメナ", "一本調子 (文章)", "一般相対性貧乳理論", "七草シリーズ", "七草粥", "三大河", "世界五分後仮説", "世界平和度指数", "両脇展開", "両論併記", "主語がない", "主語がデカい", "九ヌイルもの", "九マイルもの", "二・零零事件", "二零零事件", "五分前行動", "今、死ぬ？", "仮病", "余談だよ", "便所の落書き", "催奇", "八百屋", "公序良俗", "円周率", "冬の七草", "冷蔵庫の二者択一", "分かんな～い", "初手空爆安定", "割り箸", "創作漢字", "動く点P", "包含ノート", "十月九日の真実", "原論", "叙述トリック", "古民家カフェの惨劇", "右側", "右側｜", "名探偵武者小路の事件簿 消えた打出の小槌の謎", "周期表", "唐揚げ", "喧嘩腰", "嘘つき", "四アルファベット長英単語", "四国三郎", "四重撥音体語彙", "四重長音体語彙", "坂東太郎", "夏の七草", "夏の七草Ⅱ", "夕張市", "大根", "太字神", "女郎花", "始祖の子供", "姫女苑", "婆s", "宝塚過激団", "対偶", "寿司", "将棋", "小倉百人一首", "小籠包", "展開s", "川", "左側", "平和教育実態調査", "影踏み", "後ろ", "後方高尚帝国", "忍者ライター", "忘却", "惨闢", "成功者K・総理にされた男・ラプラスの魔女・バカの国", "排律", "撫子", "料理のさしすせそ", "新本格ミステリを識るための100冊", "新興ピロリ派", "日常炒飯事", "日本航空904便ハイジャック事件", "春の七草", "春菊", "暗黙の了解", "更送", "最重要：音声記録", "有無ジェリア", "未草", "本格ミステリ大賞小説部門", "東方project 作品一覧", "東方妖々夢~Perfect Cherry Brossome.", "東方紅魔郷~The Embodiment of Scarlet Devil.", "東西ミステリーベスト100", "根クラーベ", "桔梗", "楽しい楽しい", "構談社文庫", "正しい根拠", "武姥・鬼気効果", "歯ズラし", "死ね", "死ねカス", "比尾山大噴火", "沢山", "沢瀉", "河骨", "法廷", "湯葉", "爨", "猪子槌", "現実トロフィー", "生産性のない凄惨な罪の清算ゲーム", "発音が意味分からん英単語一覧", "白菜", "白詰草", "皿", "直訳調", "知るか", "短", "神曲", "秋の七草", "租唖", "空耳", "竹槍", "笑い顔", "筋トレするクマムシ", "筑紫次郎", "箇条書き神", "管理者語", "粛清されました", "紙ネンド", "素数", "絶望", "背面中等帝国", "背面高等帝国", "脱出ゲーム", "自学帳", "自由共産民主共和主義人民解放合衆帝国", "自由帳", "草", "萩", "葛", "葦", "葱", "蓮", "薄", "薄人", "藜", "藤袴", "藺", "虚数", "蟹光線", "袖ビーム", "記事案提案士", "記憶力がよくなるドリンク", "詈", "語弊", "誤字", "誰そカレー", "谷", "豚が飛ぶ", "走れメロス", "超人類", "軽傷土竜感", "逆立ちしても勝てない", "逆読み十行文", "連用中止法", "過言ではない", "酸闢", "重言", "長", "関係の公理", "関暁夫", "関節欺瞞文", "関節疑問文", "露草", "非自己叙述的", "靴下のあれ", "食パン", "館シリーズ", "駄洒落", "高知マグナム", "鬱", "鷺草", "１ｃｈ", "｜右側｜"];
const ARTICLESLEN = ARTICLES.length;
let text = document.getElementById("text");
let intv = document.getElementById("intv");
let rndNum = Math.floor(Math.random() * ARTICLESLEN);
let paused = false
function show(){
    if (paused) return;
    text.innerText = ARTICLES[rndNum];
    tmp = Math.floor(Math.random() * ARTICLESLEN);
    while (tmp == rndNum){
        tmp = Math.floor(Math.random() * ARTICLESLEN);
    }
    rndNum = tmp;
}

let id = setInterval(show, 1);

document.addEventListener('keypress', () => {
    if (document.activeElement == intv) return;
    paused = !paused;
});
intv.addEventListener("input", () => {
    clearInterval(id);
    let intvVal = intv.value;
    if (intvVal == 0){
        id = setInterval(show, 1);
    }else{
        id = setInterval(show, intvVal);
    }
});